// Finding scanning
DeviceNetworkEvents
| where Timestamp < ago(1h)
| where ActionType contains "HttpConnectionInspected"
| project todynamic(AdditionalFields), Timestamp,DeviceName,ActionType, RemoteUrl, RemoteIP, LocalIP
| evaluate bag_unpack(AdditionalFields)
| where direction == "In"
| project Timestamp, DeviceName, LocalIP, RemoteIP, host, user_agent
| sort by Timestamp desc